Week03/dm2-assignment-03.4.el
(defun what-is-true-about-my-engagement-with-dm2-assignment-03.4 ()
    (vector
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; What is true of my experience in general?                              ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  ["I had fun." 4]
  ["I collaborated with one or more classmates." 5]
  ["I learned something new." 5]
  ["I achieved something meaningful, or something I can build upon at a later time." 5]

  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; What is true of my report on what I learned?                            ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  ["I reported on how I attacked and solved the problem of the invert function." 0]
  ["I reported on how many 13-digit numbers I was able to verify." 0]

  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; What is true about the correctness and completeness of my code?         ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  ["It is verified by showing no output except that which would report a failure to satisfy a correct conjecture." 0]
  ["It uses bigpos arithmetic via the 'calc' package." 0]
  ["It does NOT use any floating-point arithmetic." 5]
  ["It can correctly keep running for 24 consecutive hours without running out of memory." 5]
  ["It can correctly keep running under emacs in batch mode in the background, as discussed in class." 5]

  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; What is true about the elegance of my code?                             ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  ["It has some by virtue of its correctness, as first and foremost, an elegant solution is a correct solution." 4]
  ["It increases by means of helper functions that increase cohesion, and decrease complexity." 5]
  ["It increases by having no unnecessary, redundant functionality." 5]
  ["It increases by using data types/structures as efficiently as possible." 5]
  ["My code has only function definitions (defuns) in it, NO function calls or other expressions." 5]
  ["The last function in my code is my 'main' test driver function defined as discussed in class." 5]

  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; What is true of the depth of my engagement with this assignment?        ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  ["I found and grasped a clear, unambiguous statement of the set-theoretic conjecture." 0]
  ["I succeeded in verifying this conjecture for many, many 13-digit integers." 5]
  ["I went deeper by seeking for an approach to a proof." 0]
  ["I went deeper by getting close, but not quite to the end." 0]
  ["I went deeper by getting all the way to the end, and clinching the proof." 0]
  ["I went still deeper by exploring AND reporting on possible applications of the ideas I discovered." 0]
))
